#include <stdio.h>

/*
¹®Á¦ : Á¤¼ö N(-100 <= N <= 100)ÀÌ ÁÖ¾îÁú ¶§, ´äÀ» ±¸ÇÑ´Ù.

ÇØ°á ¹æ¹ý : µþ²Ú!, µþ²Ú!!, µþ²Ú!!!À» ¹®Á¦¿¡¼­ Á¦°ÅÇÏ¸é ¿ø·¡ ¹®Á¦¸¦ º¼ ¼ö ÀÖ´Ù.
´äÀº µþ²Ú!À» 1Â÷Ç×, µþ²Ú!!À» 2Â÷Ç×, µþ²Ú!!!À» 3Â÷Ç×À¸·Î º¸¾ÒÀ» ¶§ÀÇ ´äÀÌ´Ù.
µþ²Ú!!!ÀÇ °³¼ö´Â 2°³, µþ²Ú!!ÀÇ °³¼ö´Â 30°³(µþ²Ú!!! ¹ÌÆ÷ÇÔ), µþ²Ú!ÀÇ °³¼ö´Â 38°³(µþ²Ú!!, µþ²Ú!!! ¹ÌÆ÷ÇÔ)ÀÌ¹Ç·Î
N^3 * 2 + N^2 * 30 + N * 38ÀÌ ´äÀÌ µÈ´Ù.

ÁÖ¿ä ¾Ë°í¸®Áò : ¾Öµå È¤?

ÃâÃ³ : FunctionCup 2016 HC¹ø
*/

int main(void) {
    int n;
    scanf("%d", &n);
    printf("%d", (n * n * 2 + n * 30 + 38) * n);
    return 0;
}