#include <stdio.h>
#include <string.h>

/*
문제 : N(N <= 100000) 이하의 자연수가 주어질 때, 1부터 N까지의 자연수를 연속으로 쓰면 N이 처음으로 나오는 위치는 어디인지 구한다.

해결 방법 : 1부터 N까지의 수를 연속으로 쓴 문자열을 만든 뒤, N이 처음으로 나오는 위치를 문자열 탐색 함수를 통해 찾는다.

주요 알고리즘 : 문자열, 구현, 브루트 포스

출처 : CHCI 2004RS 2번
*/

char s[524288], f[8];

int main(void) {
    int n, p = 0, fp = 0;
    scanf("%d", &n);
    for (int i = 1; i <= n; i++) {
        if (i < 10) s[p++] = i + '0';
        else if (i < 100) {
            s[p++] = i / 10 + '0';
            s[p++] = i % 10 + '0';
        }
        else if (i < 1000) {
            s[p++] = i / 100 + '0';
            s[p++] = i / 10 % 10 + '0';
            s[p++] = i % 10 + '0';
        }
        else if (i < 10000) {
            s[p++] = i / 1000 + '0';
            s[p++] = i / 100 % 10 + '0';
            s[p++] = i / 10 % 10 + '0';
            s[p++] = i % 10 + '0';
        }
        else if (i < 100000) {
            s[p++] = i / 10000 + '0';
            s[p++] = i / 1000 % 10 + '0';
            s[p++] = i / 100 % 10 + '0';
            s[p++] = i / 10 % 10 + '0';
            s[p++] = i % 10 + '0';
        }
        else {
            s[p++] = i / 100000 + '0';
            s[p++] = i / 10000 % 10 + '0';
            s[p++] = i / 1000 % 10 + '0';
            s[p++] = i / 100 % 10 + '0';
            s[p++] = i / 10 % 10 + '0';
            s[p++] = i % 10 + '0';
        }
    }
    f[0] = n / 100000 + '0';
    f[1] = n / 10000 % 10 + '0';
    f[2] = n / 1000 % 10 + '0';
    f[3] = n / 100 % 10 + '0';
    f[4] = n / 10 % 10 + '0';
    f[5] = n % 10 + '0';
    if (n < 100000) fp = 1;
    if (n < 10000) fp = 2;
    if (n < 1000) fp = 3;
    if (n < 100) fp = 4;
    if (n < 10) fp = 5;
    printf("%d", strstr(s, f + fp) - s + 1);
    return 0;
}